AcDbDimensionStyleOverrule.setDimstyleData(AcDbDimension*,AcDbObjectId)
Overrules AcDbDimension::setDimstyleData method.
pSubject: Pointer to an AcDbDimension that this
overrule is applied against.
dimstyleId: Input object ID of AcDbDimStyleTableRecord
from which to copy dimension variable information
Remarks:
Default implementation of AcDbDimensionStyleOverrule::setDimstyleData
calls protected AcDbDimension::subSetDimstyleData method.
Returns:
Returns Acad::eOk if operation is successful.

AcDbDimensionStyleOverrule.setDimstyleData(AcDbDimension*,AcDbDimStyleTableRecord*)
Overrules AcDbDimension::setDimstyleData method.
pSubject: Pointer to an AcDbDimension that this
overrule is applied against.
pRecord: Input pointer to AcDbDimStyleTableRecord
from which to copy dimension variable information.
Remarks:
Default implementation of AcDbDimensionStyleOverrule::setDimstyleData
calls protected AcDbDimension::subSetDimstyleData method.
Returns:
Returns Acad::eOk if operation is successful.

AcDbDimensionStyleOverrule.getDimstyleData(AcDbDimension!System.Runtime.CompilerServices.IsConst*,AcDbDimStyleTableRecord**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Overrules AcDbDimension::getDimstyleData method.
pSubject: Pointer to an AcDbDimension that this
overrule is applied against.
pRecord: Input pointer to an existing AcDbDimStyleTableRecord
to which the dimension variable data will be copied.
Remarks:
Default implementation of AcDbDimensionStyleOverrule::getDimstyleData
calls protected AcDbDimension::subGetDimstyleData method.
Returns:
Returns Acad::eOk if operation is successful.

AcDbDimensionStyleOverrule.setDimensionStyle(AcDbDimension*,AcDbObjectId)
Overrules AcDbDimension::setDimensionStyle.
pSubject: Pointer to an AcDbDimension that this
overrule is applied against.
dimStyleId: Input object ID of the desired AcDbDimStyleTableRecord
to be used by dimension
Remarks:
The default implementation of AcDbDimensionStyleOverrule::setDimensionStyle
calls the protected AcDbDimension::subSetDimensionStyle method.
Returns:
Returns Acad::eOk if operation is successful.

AcDbDimensionStyleOverrule.dimensionStyle(AcDbDimension!System.Runtime.CompilerServices.IsConst*)
Overrules AcDbDimension::dimensionStyle method.
Remarks:
The default implementation of
AcDbDimensionStyleOverrule::dimensionStyle calls
AcDbDimension::subDimensionStyle.
pSubject: Pointer to an AcDbDimension that this
overrule is applied against.
Returns:
Returns object ID of the AcDbDimStyleTableRecord referenced by the dimension.

AcDbDimensionStyleOverrule
AcDbDimensionStyleOverrule overrules a subset of dimension style related
operations that AcDbDimension class specifies. It is intended
as a base class for clients who want to alter some or all
behavior of a given AcDbDimension-derived class. At the base
level, each default implementation simply calls the
corresponding method in the target class.